// // Вывести на экран число e (основание натурального логарифма) с точностью до десятых.

// double e = 14.7854;
// e = Math.Round(e, 1);
// Console.WriteLine(e);



// Составить программу вывода на экран числа, вводимого с клавиатуры. Выводимому числу должно предшествовать сообщение «Вы ввели число».
// Console.WriteLine("Введите число : ");
// int num = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine($"ВЫ ВВЕЛИ ЧИСЛО :  {num}");